In [15]:
import pandas as pd  
  
# assign data of lists.  
data = {'date': ['20110201', '20110202', '20110203', '20110204', '20110205'], 
        'count': [5, 1, 0, 21, 2]}  

# Create DataFrame  
df1 = pd.DataFrame(data)

df1.head()

       date  count
0  20110201      5
1  20110202      1
2  20110203      0
3  20110204     21
4  20110205      2

In [16]:
# assign data of lists.  
data = {'date': ['20110201', '20110202', '20110203', '20110204', '20110205'], 
        'count': [20, 21, 19, 5, 2]}  

# Create DataFrame  
df2 = pd.DataFrame(data)

df2.head()

       date  count
0  20110201     20
1  20110202     21
2  20110203     19
3  20110204      5
4  20110205      2

### concat by appending rows

In [17]:
df_row = pd.concat([df1, df2], axis=0, ignore_index=True)

print(df_row)

       date  count
0  20110201      5
1  20110202      1
2  20110203      0
3  20110204     21
4  20110205      2
5  20110201     20
6  20110202     21
7  20110203     19
8  20110204      5
9  20110205      2

### Remove duplicates

In [20]:
df_row.drop_duplicates()

       date  count
0  20110201      5
1  20110202      1
2  20110203      0
3  20110204     21
4  20110205      2
5  20110201     20
6  20110202     21
7  20110203     19
8  20110204      5

### concat by appending columns

In [19]:
df_column = pd.concat([df1, df2], axis = 1)
print(df_column)

       date  count      date  count
0  20110201      5  20110201     20
1  20110202      1  20110202     21
2  20110203      0  20110203     19
3  20110204     21  20110204      5
4  20110205      2  20110205      2